---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementLogicalFilter
source: html/a12ccff6-75e6-fc39-b0a4-894d9a3554af.htm
---
# ElementLogicalFilter Members

Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter.